Table of Contents
 Class GrpcMethodInvokerHandler
Namespace
IdeaStatiCa.Plugin.Grpc.Reflection
Assembly
IdeaStatiCa.Plugin.dll
public class GrpcMethodInvokerHandler : IMethodInvoker, IGrpcMessageHandler
Inheritance
object
GrpcMethodInvokerHandler
Implements
IMethodInvoker
IGrpcMessageHandler
Derived
ProjectContentClientHandler
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Constructors
 GrpcMethodInvokerHandler(string, IGrpcSender, IPluginLogger)
Constructor
public GrpcMethodInvokerHandler(string handlerName, IGrpcSender grpcSender, IPluginLogger logger)
Parameters
handlerName string
Name of the message handler
grpcSender IGrpcSender
Message sender
logger IPluginLogger
Logger
Fields
 HandlerName
public readonly string HandlerName
Field Value
string
Properties
 GrpcSender
public IGrpcSender GrpcSender { get; }
Property Value
IGrpcSender
Methods
 HandleClientMessage(GrpcMessage, IGrpcSender)
Handles response incoming from the server.
public Task<object> HandleClientMessage(GrpcMessage message, IGrpcSender grpcSender)
Parameters
message GrpcMessage
grpcSender IGrpcSender
Returns
Task<object>
 HandleServerMessage(GrpcMessage, IGrpcSender)
Handles request incoming from the client.
public Task<object> HandleServerMessage(GrpcMessage message, IGrpcSender grpcSender)
Parameters
message GrpcMessage
grpcSender IGrpcSender
Returns
Task<object>
 InvokeMethod<T>(string, Type, params object[])
Invoke method by reflex
public T InvokeMethod<T>(string methodName, Type returnType, params object[] arguments)
Parameters
methodName string
Name of the method to invoke
returnType Type
Type of the return value
arguments object[]
arguments which will be passed to the invoked method
Returns
T
Result of the method
Type Parameters
T
Type of the result
Exceptions
ArgumentException
Exception is thrown in case of an error
 SendMessageDataSync(GrpcMessage)
public GrpcMessage SendMessageDataSync(GrpcMessage grpcMessage)
Parameters
grpcMessage GrpcMessage
Returns
GrpcMessage
 Edit this page